load-test.yml
config: 
  target: http://127.0.0.1:3000
  phases:
    - duration: 60 # how long the phase lasts in seconds
      arrivalRate: 1 # how many requests/users per second
      rampTo: 5 # maximum number of requests/users 
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100 
  ensure:
      thresholds:
        - http.response_time.p99: 750 # 99% of all requests must complete within 750 ms, or the test fails.
        - http.response_time.p95: 500 # 95% of all requests must complete within 500 ms, or the test fails.
      maxErrorRate: 1
scenarios:
  - flow:
      - loop: # this will loop these requests using the url provided below
        - get:
            url: "/ForumHome" 
        - get:
            url: "/community/74" 
        - get:
            url: "/JobBoardHome" 
        count: 5 # number of iterations